# Copyright (C) 2019 Intel Corporation
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
# http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions
# and limitations under the License.

""" This module contains Dataset class that operates with training data. """

import os
import numpy as np
import tensorflow as tf
import cv2
import io

class Dataset():
    """ Class for working with training datasets. """

    def __init__(self, annotation_path, image_width, image_height, batch_size=1, shuffle=False, repeat=None):

        impaths, labels = Dataset.parse_datasets_arg(annotation_path)
        #print(labels)
        #print(type(labels[0]))
        
        self.batch_size = batch_size
        self.image_height = image_height
        self.image_width = image_width
        self.size = len(impaths)
        self.char_to_int, self.int_to_char, self.num_classes = Dataset.create_character_maps()
        self.num_classes = self.num_classes 
        dataset = tf.data.Dataset.from_tensor_slices((impaths, labels))
        if shuffle:
            dataset = dataset.shuffle(len(impaths), reshuffle_each_iteration=True)
        dataset = dataset.map(
            lambda filename, label: tuple(
                tf.py_func(self.read_py_function, [filename, label], [tf.float32, tf.string])))
        dataset = dataset.map(
            lambda image, label: tuple(
                tf.py_func(self.convert_labels_to_int32_array, [image, label],
                           [tf.float32, tf.int32])))
        dataset = dataset.map(
            lambda image, label: tuple((image, self.to_sparse_tensor(label))))

        dataset = dataset.batch(batch_size, drop_remainder=True)
        dataset = dataset.map(self.set_shapes)
        dataset = dataset.repeat(repeat)
        dataset = dataset.prefetch(buffer_size=tf.contrib.data.AUTOTUNE)

        self.dataset = dataset

    def __call__(self):
        return self.dataset

    def __len__(self):
        return self.size

    def convert_labels_to_int32_array(self, image, label):
        """ Converts text to integer representation. """
        
        #label=label.split(' ')[-1]
        #print(type(label))
        values = np.array([self.char_to_int[y] for y in label.decode('utf-8').lower()],
                          dtype=np.int32)
        return image, values

    def set_shapes(self, image, labels):
        """ Sets shapes for tensors. """

        image.set_shape([self.batch_size, self.image_height, self.image_width, 1])
        return image, labels

    def read_py_function(self, filename, label):
        """ Reads and pre-processes an image. """

        try:
            image = cv2.imread(filename.decode('utf-8'), cv2.IMREAD_COLOR)
            image = cv2.cvtColor(image, cv2.COLOR_BGR2GRAY)
            image = image.astype(np.float32)
            image = cv2.resize(image, (self.image_width, self.image_height))
            image = np.expand_dims(image, axis=-1)
        except:
            print(filename)
            print(image.shape)
            raise Exception
        return image, label

    @staticmethod
    def create_character_maps():
        """ Creates character-to-int and int-to-character maps. """
        #alfabet = u' 0abcdefghijklmnopqrstuvwxyz不用留地址了！"洪裳说孩林晓梅三会就把一同过学免除，所以总训斥贾在中国作家协第届儿童文明天放他请来思想走暗对吴巧翻到本介绍龙传正认识你很九、生日派巴的回信也得稍拿点架为。要气记-封牵连道下午资料后刀子原那是胡甲级高兴又蹦可还胜早们玩去吧话印象智低着头脸绝望完全像只断翅膀机向惊慌人急匆闯进劈问：友写做字好爸叹口妈摊开忙准上约校大门集合里按读书已经睡几个私拆我给草？切包照张相保证身都少外面业余杯鲜桔水和若干觉喂这插座活雷锋专管老兄起轰动先出逃惭愧么弄副鬼样弯眉达室恳爽快怎填医有些阵整报复杜小求往比宜吗区长风公园妹装邱士力肩恨能当场跟庆祝查师题推称号心导打悔满累死惜站边没苦自己王种钢笔习班即怪表情法听却告诉才关眼前算冷百分她笑什难计策名因知祁抄袭事—摘挽狂澜制止恶斗十五硬女半伙时父亲多艺术团现毕竟迅速看民鲁盆兜争论版单位响亮店独缺药仿佛见电脑劳体遇危而之更谈丫真嘴舌叫Y色调如厨房饭桌间且荐怕冒险定跃成功臣队瘪考托福肯役双戏院云感梨汁…喝差套颜理市越太谨曾美丽姆极任划盗步夺路但与检讨两背爵物敢《威尼斯商》晚夜二拨通片工厂宣布让块混票神支柱旗帜产系周年帽始发挥受哪懂消息灵疯材青嘟哝无精采掉另再次赛啦手喜欢吃咸住踏铁栅跳重庭希委屈必此偏初犯赞莎亚示目光充崇敬造萍唯朋倒英语牢骚舍懒方清脆嗓似指变服务歌泣行被视然搭霉台演忍钱超员频招利逗碰尽量永远纸条忸怩劫持呀它味痛并未流露何捂角嚎曲刚摸验顿呢；假赏勇夫男折扣笨瓜股陈闲察疼反32透秘顺挂悄八选举波居乐唱抽烟直忘怀课答提够潇洒篮球则世收诗冲排蹲凡瘦户主讲究礼哥概影妙黯找火转贸途红突击意容咧阿伦值至赶挺忠类东西深贻适辅许退稿错寄候便警键卡胖畅刻跑责命令抗拒N飞平客须结挑新凭今虑汉度逻搞宝贝唤接抱常牌熟买卖搅办病艳呼声需领吹每抓紧舞拳恼羞养赠谢千金强静坚瞧柬牛皮袋塞海画鸡首蠢滋剪嘻善于足霆垮从互应喔拔助念议乎四挤效果怒或参加厌该氛谁赖罢否将尖教睬份泼阁练扛车腿铺迁万别六奇迹根等伸微颤宠救皆血痕失揭姓奋移科拜C迷鱼葱姜热降温疑漏孔乙戒界星志实偶拍洋构入邢补雄略终细兵剑存随虽掌握词哦设久酸配奖狼呵哈纪性评忽追戴丝镜战帮乱奶广妖涂眯态毅鼓励敏粗脚治癫蛤蟆铃具备批糊属闹蛮横额章使休乌虚酒胆俞稀松枕忧躺各厉害解散摄克案注立吼破墙窘吆逢钟蹈滔漂纯展句拼慢脱鞋咳嗽带患音特众确率部劲江泽压愚堆侠秒夕司莫睛席征联谋杀凶狠秃顶炮较优近积粱丑伤愤疤腾显基耐酬培者雇佣窗傲剩船床予愿聂耳跻迟脾妇由决坐凑丁署省锻炼驳施政纲绉骂朝努悲观振央落抬嘛吵瞌其尘爱投密武严眠耸节嗨般删异弓护烧厕质盛凌肢壮牺牲黑板言费麻烦灰剧件寻埋伏瞪拉膨胀试幅摇叔伯堂姐宏伟标引胸恭送仪式图简咖啡君旧偷束藕荷泰戈尔筒华捏抖搂惹页孤抹罕碗喊肚钻靠段慎石袖酝酿贵竹祸财雨淋揉鼻喷漠懦喻贴播腻社豹取甚聊婆最史犟坏哲咬代徐兼傻忆停涉仙捡母型仅桩隐军族醒底灭肤白皙搬憋掏侦番绰故程辑格诚奴隶惋吞吐食减寿敲抢庞阶糟糕盘碎普秦冰箱荤菜煮喉咙研铜畏蔼化肇处玻璃渣踪梦奔零纠躲毫噢库腰盼共党卫魂哭斤顾彼柴叮蔡闷狡黠含裤扫净浅骄淌汗烈浪朵访泪围磁待临罗蒙毛欣轻埃及塔困预廊镇例刘饶趣哇汪胞胎易南辕北辙遗甩缓胳膊哑袜款月毁撑搁非仍拦圆兑垫沙替交讯彩洁荟萃运范空捞爬嚼糖香呃您翟丰棚辆安秀扬玄兮厚舒宽迎聚皱援历藏蜡烛吩咐滑稽踢嚷挡堵败庸荣咱噩刷牙斩钉截数欠扑哧源洗职歹徒犹豫衫昏径询绊杂繁裙宾谦享圾递据饱渐润歪剔屋肿榜朴素涌餐宴肉冠组织妨元七趟彻软吟韩短博形卷权遵邀钩价棍啼郑煎熬慷慨滚烂忿砖订眨义漓拖莺恰谊轶扔蛋肥升贪寺臂健康攻譬俩谎捶残蛇哼激期橱续创促品录窍扶邮古呈爆幸亏啪噪烤晕济绢盒河猛耿承竖饿冤改继闪夹宅虫S惨奈遍野炊砸皇屁履窝晨屉惕孝扎列农壳隔触簸擂奏佩炎坟内膏状丈律左喘碌屡姑娘城OK楚辈墩骑锈悉木拘阅纺辨串污蔑脏楼筋销恢燃吸岁限局货离担幻依某嗯扒巫锁拾游枪擒敌纳米换贩摆阔肌弹灯笼编盾陶醉沉浸致李扭谍馁建筑码鹃既嘀咕惠勤哨陪垂丧默况秋苏矛借载阴阳篇沾飘括尴尬愁肠忌剂燎泡狭窄马诸境怔探卓右弟贼器晃蜷津猪肝紫操辞俯卧详庇擞狗兢尝圈屑嫌索酷付维秩序甜溜锐拎灾貌锦蠕睁沸锅盖贺衷毒恐慕蓉获炒矢禁闭吁（豁势亿修饰层惯油俱荒尾育肖拯肃末曝怅棒籍踮坯措勃粉舟敞婉狈憎搜刮释嫩愉旅规矩呆熊线哐猜缘鸦雀乖跺甘踹婶芮杰恒汇碟乍披技羡馆翔宋楷耻册皂核娱伊挨启稳偿煞寸尊延搔描淡佼缩固执倍痴景衣顽堡垒唠鄙哀端擦枝悦疙瘩梆犒勾弱瘾驶舅花溢妄缝模叙守坑豪迈佯嘘宁穿柄舆纱荡弃疾摔惴磨链吓肘颗夸撒轮凳惟踩蚂惧幼雌昂闻董瑞峻杳眸聪颖瞒霹雳漫仑废嗬瞻慰恋辩挠仔喇叭缠馊郊沫浓拥踱负徕愣堕讳湿漉吻鸣薄潦啃拭庄赤歉腹涎趁叉翩拐绿欲僵郎误摞侄冬怵官添矿泉舰帐帅曹罪魁羽损簿宿怨嘿榨陌E蒜脊矮叽寒怜召悟齐姗档违池晶椅瞥焦嘲揍抡篓唬赦辛盲椰垃咄逼巷输控欺侮骨虎潮炸遭岔乡栏蹑霎眶盈驻鼠谜捐扮梭归诀刺针颠躁枉症廉苍射蚊奢侈卸腔轩劝携）擅占臭1蜜魏篆绪赋傍瘫挣魄群捅叨锤噼捆赫祟哄捣搏仇橙黄扰霍麦防悠嗷增娑箭啸勉丢疏涨弛屏惑拢著宇宙瓶绽佑裱捧申登鸭捺春伪棵咋测恪诺殷刹剥跨缭耍估巡壁娇聘银灌锲爹鼎避捉匕饮烫骗揽绩谣益萨佐奉拄昆炯吊纷纤巨祖佳辱脖旁摩附蹄讽讶良帝撇诡睽琅抵倚掀兰·德雪厅沮赌岂渡萝卜殊循昨土跌宕趔颓扯勿扁桃腺斟酌陷齿柔蜇挖芒际掖贡宗诧恩慈签杆狐绵箍荫潜肋涤墨徽晴羹诌蓬富蛛购项析汤韧唉滴抛旦嚓颊懈乘斜岑凯趄趴奚伽础乒乓罐粒沓统臀乏旱娃懑沛猴译○汽泳兽赔裹唇券辉煌涮烘障山贬迪忐忑邻聋旋抚蚤淮柳筷誓怂恿杠伍堪审允砰拙冥膝谓监典襟暂喏芭蕾茸泛掺楞咒营鞠琢融井悸诩供帖裆蹚髦匹铅劣匿拟抒耶阻垢罚佬俭雅竞判坦玲衔豆浆逐啰嗦慧隆扩售扉苛肆侧刃陆蜂啊置醋筹刨姿斑纹树仓淘鸟贿赂胃献搡蹭鲛绕刊乳赢枚邓稚幽穆伞叶综攀塑岸揪婿押耀黛玉倡州攥舵翁塌映田季灿噜妻胫琐蚁挪咏珍癞冻妥茅衬涯苗勒染浑晦扳崩夭尚倾搽迫抑辣.唔驾京杭苟咛嗖兔酵蓝褒呐珑趋悚诲裁怦饼傅搓龄巾帼矫毡懊T恤溶娄踊洞幕览揶揄羊H躬猫懵渴哎朗诵渊凉镖羲悯驰栗航喳栖贯暴返彰街垠撞浮炬吱诞暖叼储辟耗熄沿吝骷髅甫洛震敛捷森茶诱饵盐咚梳网谅孜吉憾趿糙俘僻脉猾燕粘遥啤瓦翘拇缕郁脯赚遮曰疗奥液抠阐述倦楔旨韦粹冶迂逛铆凛绒虏奸蒂芬肺疚挫亡逝寞尤嘤昧催俊晒闸杞菲鹤革瑰哗赴衰癖衡铸岗坎坷寂椒姊汲惮践卍\084/9567狙MB环L+F汐猎撼莱!A[]:魔撤GIRU()VJ,D遛Z酪】撸$WP昵X圣槽伐'
        #alfabet = u' 0abcdefghijklmnopqrstuvwxyz不用留地址了！"洪裳说孩林晓梅三会就把一同过学免除，所以总训斥贾在中国作家协第届儿童文明天放他请来思想走暗对吴巧翻到本介绍龙传正认识你很九、生日派巴的回信也得稍拿点架为。要气记-封牵连道下午资料后刀子原那是胡甲级高兴又蹦可还胜早们玩去吧话印象智低着头脸绝望完全像只断翅膀机向惊慌人急匆闯进劈问：友写做字好爸叹口妈摊开忙准上约校大门集合里按读书已经睡几个私拆我给草？切包照张相保证身都少外面业余杯鲜桔水和若干觉喂这插座活雷锋专管老兄起轰动先出逃惭愧么弄副鬼样弯眉达室恳爽快怎填医有些阵整报复杜小求往比宜吗区长风公园妹装邱士力肩恨能当场跟庆祝查师题推称号心导打悔满累死惜站边没苦自己王种钢笔习班即怪表情法听却告诉才关眼前算冷百分她笑什难计策名因知祁抄袭事—摘挽狂澜制止恶斗十五硬女半伙时父亲多艺术团现毕竟迅速看民鲁盆兜争论版单位响亮店独缺药仿佛见电脑劳体遇危而之更谈丫真嘴舌叫Y色调如厨房饭桌间且荐怕冒险定跃成功臣队瘪考托福肯役双戏院云感梨汁…喝差套颜理市越太谨曾美丽姆极任划盗步夺路但与检讨两背爵物敢《威尼斯商》晚夜二拨通片工厂宣布让块混票神支柱旗帜产系周年帽始发挥受哪懂消息灵疯材青嘟哝无精采掉另再次赛啦手喜欢吃咸住踏铁栅跳重庭希委屈必此偏初犯赞莎亚示目光充崇敬造萍唯朋倒英语牢骚舍懒方清脆嗓似指变服务歌泣行被视然搭霉台演忍钱超员频招利逗碰尽量永远纸条忸怩劫持呀它味痛并未流露何捂角嚎曲刚摸验顿呢；假赏勇夫男折扣笨瓜股陈闲察疼反32透秘顺挂悄八选举波居乐唱抽烟直忘怀课答提够潇洒篮球则世收诗冲排蹲凡瘦户主讲究礼哥概影妙黯找火转贸途红突击意容咧阿伦值至赶挺忠类东西深贻适辅许退稿错寄候便警键卡胖畅刻跑责命令抗拒N飞平客须结挑新凭今虑汉度逻搞宝贝唤接抱常牌熟买卖搅办病艳呼声需领吹每抓紧舞拳恼羞养赠谢千金强静坚瞧柬牛皮袋塞海画鸡首蠢滋剪嘻善于足霆垮从互应喔拔助念议乎四挤效果怒或参加厌该氛谁赖罢否将尖教睬份泼阁练扛车腿铺迁万别六奇迹根等伸微颤宠救皆血痕失揭姓奋移科拜C迷鱼葱姜热降温疑漏孔乙戒界星志实偶拍洋构入邢补雄略终细兵剑存随虽掌握词哦设久酸配奖狼呵哈纪性评忽追戴丝镜战帮乱奶广妖涂眯态毅鼓励敏粗脚治癫蛤蟆铃具备批糊属闹蛮横额章使休乌虚酒胆俞稀松枕忧躺各厉害解散摄克案注立吼破墙窘吆逢钟蹈滔漂纯展句拼慢脱鞋咳嗽带患音特众确率部劲江泽压愚堆侠秒夕司莫睛席征联谋杀凶狠秃顶炮较优近积粱丑伤愤疤腾显基耐酬培者雇佣窗傲剩船床予愿聂耳跻迟脾妇由决坐凑丁署省锻炼驳施政纲绉骂朝努悲观振央落抬嘛吵瞌其尘爱投密武严眠耸节嗨般删异弓护烧厕质盛凌肢壮牺牲黑板言费麻烦灰剧件寻埋伏瞪拉膨胀试幅摇叔伯堂姐宏伟标引胸恭送仪式图简咖啡君旧偷束藕荷泰戈尔筒华捏抖搂惹页孤抹罕碗喊肚钻靠段慎石袖酝酿贵竹祸财雨淋揉鼻喷漠懦喻贴播腻社豹取甚聊婆最史犟坏哲咬代徐兼傻忆停涉仙捡母型仅桩隐军族醒底灭肤白皙搬憋掏侦番绰故程辑格诚奴隶惋吞吐食减寿敲抢庞阶糟糕盘碎普秦冰箱荤菜煮喉咙研铜畏蔼化肇处玻璃渣踪梦奔零纠躲毫噢库腰盼共党卫魂哭斤顾彼柴叮蔡闷狡黠含裤扫净浅骄淌汗烈浪朵访泪围磁待临罗蒙毛欣轻埃及塔困预廊镇例刘饶趣哇汪胞胎易南辕北辙遗甩缓胳膊哑袜款月毁撑搁非仍拦圆兑垫沙替交讯彩洁荟萃运范空捞爬嚼糖香呃您翟丰棚辆安秀扬玄兮厚舒宽迎聚皱援历藏蜡烛吩咐滑稽踢嚷挡堵败庸荣咱噩刷牙斩钉截数欠扑哧源洗职歹徒犹豫衫昏径询绊杂繁裙宾谦享圾递据饱渐润歪剔屋肿榜朴素涌餐宴肉冠组织妨元七趟彻软吟韩短博形卷权遵邀钩价棍啼郑煎熬慷慨滚烂忿砖订眨义漓拖莺恰谊轶扔蛋肥升贪寺臂健康攻譬俩谎捶残蛇哼激期橱续创促品录窍扶邮古呈爆幸亏啪噪烤晕济绢盒河猛耿承竖饿冤改继闪夹宅虫S惨奈遍野炊砸皇屁履窝晨屉惕孝扎列农壳隔触簸擂奏佩炎坟内膏状丈律左喘碌屡姑娘城OK楚辈墩骑锈悉木拘阅纺辨串污蔑脏楼筋销恢燃吸岁限局货离担幻依某嗯扒巫锁拾游枪擒敌纳米换贩摆阔肌弹灯笼编盾陶醉沉浸致李扭谍馁建筑码鹃既嘀咕惠勤哨陪垂丧默况秋苏矛借载阴阳篇沾飘括尴尬愁肠忌剂燎泡狭窄马诸境怔探卓右弟贼器晃蜷津猪肝紫操辞俯卧详庇擞狗兢尝圈屑嫌索酷付维秩序甜溜锐拎灾貌锦蠕睁沸锅盖贺衷毒恐慕蓉获炒矢禁闭吁（豁势亿修饰层惯油俱荒尾育肖拯肃末曝怅棒籍踮坯措勃粉舟敞婉狈憎搜刮释嫩愉旅规矩呆熊线哐猜缘鸦雀乖跺甘踹婶芮杰恒汇碟乍披技羡馆翔宋楷耻册皂核娱伊挨启稳偿煞寸尊延搔描淡佼缩固执倍痴景衣顽堡垒唠鄙哀端擦枝悦疙瘩梆犒勾弱瘾驶舅花溢妄缝模叙守坑豪迈佯嘘宁穿柄舆纱荡弃疾摔惴磨链吓肘颗夸撒轮凳惟踩蚂惧幼雌昂闻董瑞峻杳眸聪颖瞒霹雳漫仑废嗬瞻慰恋辩挠仔喇叭缠馊郊沫浓拥踱负徕愣堕讳湿漉吻鸣薄潦啃拭庄赤歉腹涎趁叉翩拐绿欲僵郎误摞侄冬怵官添矿泉舰帐帅曹罪魁羽损簿宿怨嘿榨陌E蒜脊矮叽寒怜召悟齐姗档违池晶椅瞥焦嘲揍抡篓唬赦辛盲椰垃咄逼巷输控欺侮骨虎潮炸遭岔乡栏蹑霎眶盈驻鼠谜捐扮梭归诀刺针颠躁枉症廉苍射蚊奢侈卸腔轩劝携）擅占臭1蜜魏篆绪赋傍瘫挣魄群捅叨锤噼捆赫祟哄捣搏仇橙黄扰霍麦防悠嗷增娑箭啸勉丢疏涨弛屏惑拢著宇宙瓶绽佑裱捧申登鸭捺春伪棵咋测恪诺殷刹剥跨缭耍估巡壁娇聘银灌锲爹鼎避捉匕饮烫骗揽绩谣益萨佐奉拄昆炯吊纷纤巨祖佳辱脖旁摩附蹄讽讶良帝撇诡睽琅抵倚掀兰·德雪厅沮赌岂渡萝卜殊循昨土跌宕趔颓扯勿扁桃腺斟酌陷齿柔蜇挖芒际掖贡宗诧恩慈签杆狐绵箍荫潜肋涤墨徽晴羹诌蓬富蛛购项析汤韧唉滴抛旦嚓颊懈乘斜岑凯趄趴奚伽础乒乓罐粒沓统臀乏旱娃懑沛猴译○汽泳兽赔裹唇券辉煌涮烘障山贬迪忐忑邻聋旋抚蚤淮柳筷誓怂恿杠伍堪审允砰拙冥膝谓监典襟暂喏芭蕾茸泛掺楞咒营鞠琢融井悸诩供帖裆蹚髦匹铅劣匿拟抒耶阻垢罚佬俭雅竞判坦玲衔豆浆逐啰嗦慧隆扩售扉苛肆侧刃陆蜂啊置醋筹刨姿斑纹树仓淘鸟贿赂胃献搡蹭鲛绕刊乳赢枚邓稚幽穆伞叶综攀塑岸揪婿押耀黛玉倡州攥舵翁塌映田季灿噜妻胫琐蚁挪咏珍癞冻妥茅衬涯苗勒染浑晦扳崩夭尚倾搽迫抑辣.唔驾京杭苟咛嗖兔酵蓝褒呐珑趋悚诲裁怦饼傅搓龄巾帼矫毡懊T恤溶娄踊洞幕览揶揄羊H躬猫懵渴哎朗诵渊凉镖羲悯驰栗航喳栖贯暴返彰街垠撞浮炬吱诞暖叼储辟耗熄沿吝骷髅甫洛震敛捷森茶诱饵盐咚梳网谅孜吉憾趿糙俘僻脉猾燕粘遥啤瓦翘拇缕郁脯赚遮曰疗奥液抠阐述倦楔旨韦粹冶迂逛铆凛绒虏奸蒂芬肺疚挫亡逝寞尤嘤昧催俊晒闸杞菲鹤革瑰哗赴衰癖衡铸岗坎坷寂椒姊汲惮践卍84/9567狙MB环L+F汐猎撼莱!A[]:魔撤GIRU()VJ,D遛Z酪】撸$WP昵X圣槽伐_|珠“>涛汹澎湃爷”靴仆鞭嵌霸愈;@渔藻泥叩槛侍斧钺稼蔚膳喧?貂砌囱叱贱俄拗#绣&砍'
        #alfabet = u' abcdefghijklmnopqrstuvwxyz不用留地址了！"洪裳说孩林晓梅三会就把一同过学免除，所以总训斥贾在中国作家协第届儿童文明天放他请来思想走暗对吴巧翻到本介绍龙传正认识你很九、生日派巴的回信也得稍拿点架为。要气记-封牵连道下午资料后刀子原那是胡甲级高兴又蹦可还胜早们玩去吧话印象智低着头脸绝望完全像只断翅膀机向惊慌人急匆闯进劈问：友写做字好爸叹口妈摊开忙准上约校大门集合里按读书已经睡几个私拆我给草？切包照张相保证身都少外面业余杯鲜桔水和若干觉喂这插座活雷锋专管老兄起轰动先出逃惭愧么弄副鬼样弯眉达室恳爽快怎填医有些阵整报复杜小求往比宜吗区长风公园妹装邱士力肩恨能当场跟庆祝查师题推称号心导打悔满累死惜站边没苦自己王种钢笔习班即怪表情法听却告诉才关眼前算冷百分她笑什难计策名因知祁抄袭事—摘挽狂澜制止恶斗十五硬女半伙时父亲多艺术团现毕竟迅速看民鲁盆兜争论版单位响亮店独缺药仿佛见电脑劳体遇危而之更谈丫真嘴舌叫Y色调如厨房饭桌间且荐怕冒险定跃成功臣队瘪考托福肯役双戏院云感梨汁…喝差套颜理市越太谨曾美丽姆极任划盗步夺路但与检讨两背爵物敢《威尼斯商》晚夜二拨通片工厂宣布让块混票神支柱旗帜产系周年帽始发挥受哪懂消息灵疯材青嘟哝无精采掉另再次赛啦手喜欢吃咸住踏铁栅跳重庭希委屈必此偏初犯赞莎亚示目光充崇敬造萍唯朋倒英语牢骚舍懒方清脆嗓似指变服务歌泣行被视然搭霉台演忍钱超员频招利逗碰尽量永远纸条忸怩劫持呀它味痛并未流露何捂角嚎曲刚摸验顿呢；假赏勇夫男折扣笨瓜股陈闲察疼反32透秘顺挂悄八选举波居乐唱抽烟直忘怀课答提够潇洒篮球则世收诗冲排蹲凡瘦户主讲究礼哥概影妙黯找火转贸途红突击意容咧阿伦值至赶挺忠类东西深贻适辅许退稿错寄候便警键卡胖畅刻跑责命令抗拒N飞平客须结挑新凭今虑汉度逻搞宝贝唤接抱常牌熟买卖搅办病艳呼声需领吹每抓紧舞拳恼羞养赠谢千金强静坚瞧柬牛皮袋塞海画鸡首蠢滋剪嘻善于足霆垮从互应喔拔助念议乎四挤效果怒或参加厌该氛谁赖罢否将尖教睬份泼阁练扛车腿铺迁万别六奇迹根等伸微颤宠救皆血痕失揭姓奋移科拜C迷鱼葱姜热降温疑漏孔乙戒界星志实偶拍洋构入邢补雄略终细兵剑存随虽掌握词哦设久酸配奖狼呵哈纪性评忽追戴丝镜战帮乱奶广妖涂眯态毅鼓励敏粗脚治癫蛤蟆铃具备批糊属闹蛮横额章使休乌虚酒胆俞稀松枕忧躺各厉害解散摄克案注立吼破墙窘吆逢钟蹈滔漂纯展句拼慢脱鞋咳嗽带患音特众确率部劲江泽压愚堆侠秒夕司莫睛席征联谋杀凶狠秃顶炮较优近积粱丑伤愤疤腾显基耐酬培者雇佣窗傲剩船床予愿聂耳跻迟脾妇由决坐凑丁署省锻炼驳施政纲绉骂朝努悲观振央落抬嘛吵瞌其尘爱投密武严眠耸节嗨般删异弓护烧厕质盛凌肢壮牺牲黑板言费麻烦灰剧件寻埋伏瞪拉膨胀试幅摇叔伯堂姐宏伟标引胸恭送仪式图简咖啡君旧偷束藕荷泰戈尔筒华捏抖搂惹页孤抹罕碗喊肚钻靠段慎石袖酝酿贵竹祸财雨淋揉鼻喷漠懦喻贴播腻社豹取甚聊婆最史犟坏哲咬代徐兼傻忆停涉仙捡母型仅桩隐军族醒底灭肤白皙搬憋掏侦番绰故程辑格诚奴隶惋吞吐食减寿敲抢庞阶糟糕盘碎普秦冰箱荤菜煮喉咙研铜畏蔼化肇处玻璃渣踪梦奔零纠躲毫噢库腰盼共党卫魂哭斤顾彼柴叮蔡闷狡黠含裤扫净浅骄淌汗烈浪朵访泪围磁待临罗蒙毛欣轻埃及塔困预廊镇例刘饶趣哇汪胞胎易南辕北辙遗甩缓胳膊哑袜款月毁撑搁非仍拦圆兑垫沙替交讯彩洁荟萃运范空捞爬嚼糖香呃您翟丰棚辆安秀扬玄兮厚舒宽迎聚皱援历藏蜡烛吩咐滑稽踢嚷挡堵败庸荣咱噩刷牙斩钉截数欠扑哧源洗职歹徒犹豫衫昏径询绊杂繁裙宾谦享圾递据饱渐润歪剔屋肿榜朴素涌餐宴肉冠组织妨元七趟彻软吟韩短博形卷权遵邀钩价棍啼郑煎熬慷慨滚烂忿砖订眨义漓拖莺恰谊轶扔蛋肥升贪寺臂健康攻譬俩谎捶残蛇哼激期橱续创促品录窍扶邮古呈爆幸亏啪噪烤晕济绢盒河猛耿承竖饿冤改继闪夹宅虫S惨奈遍野炊砸皇屁履窝晨屉惕孝扎列农壳隔触簸擂奏佩炎坟内膏状丈律左喘碌屡姑娘城OK楚辈墩骑锈悉木拘阅纺辨串污蔑脏楼筋销恢燃吸岁限局货离担幻依某嗯扒巫锁拾游枪擒敌纳米换贩摆阔肌弹灯笼编盾陶醉沉浸致李扭谍馁建筑码鹃既嘀咕惠勤哨陪垂丧默况秋苏矛借载阴阳篇沾飘括尴尬愁肠忌剂燎泡狭窄马诸境怔探卓右弟贼器晃蜷津猪肝紫操辞俯卧详庇擞狗兢尝圈屑嫌索酷付维秩序甜溜锐拎灾貌锦蠕睁沸锅盖贺衷毒恐慕蓉获炒矢禁闭吁（豁势亿修饰层惯油俱荒尾育肖拯肃末曝怅棒籍踮坯措勃粉舟敞婉狈憎搜刮释嫩愉旅规矩呆熊线哐猜缘鸦雀乖跺甘踹婶芮杰恒汇碟乍披技羡馆翔宋楷耻册皂核娱伊挨启稳偿煞寸尊延搔描淡佼缩固执倍痴景衣顽堡垒唠鄙哀端擦枝悦疙瘩梆犒勾弱瘾驶舅花溢妄缝模叙守坑豪迈佯嘘宁穿柄舆纱荡弃疾摔惴磨链吓肘颗夸撒轮凳惟踩蚂惧幼雌昂闻董瑞峻杳眸聪颖瞒霹雳漫仑废嗬瞻慰恋辩挠仔喇叭缠馊郊沫浓拥踱负徕愣堕讳湿漉吻鸣薄潦啃拭庄赤歉腹涎趁叉翩拐绿欲僵郎误摞侄冬怵官添矿泉舰帐帅曹罪魁羽损簿宿怨嘿榨陌E蒜脊矮叽寒怜召悟齐姗档违池晶椅瞥焦嘲揍抡篓唬赦辛盲椰垃咄逼巷输控欺侮骨虎潮炸遭岔乡栏蹑霎眶盈驻鼠谜捐扮梭归诀刺针颠躁枉症廉苍射蚊奢侈卸腔轩劝携）擅占臭1蜜魏篆绪赋傍瘫挣魄群捅叨锤噼捆赫祟哄捣搏仇橙黄扰霍麦防悠嗷增娑箭啸勉丢疏涨弛屏惑拢著宇宙瓶绽佑裱捧申登鸭捺春伪棵咋测恪诺殷刹剥跨缭耍估巡壁娇聘银灌锲爹鼎避捉匕饮烫骗揽绩谣益萨佐奉拄昆炯吊纷纤巨祖佳辱脖旁摩附蹄讽讶良帝撇诡睽琅抵倚掀兰·德雪厅沮赌岂渡萝卜殊循昨土跌宕趔颓扯勿扁桃腺斟酌陷齿柔蜇挖芒际掖贡宗诧恩慈签杆狐绵箍荫潜肋涤墨徽晴羹诌蓬富蛛购项析汤韧唉滴抛旦嚓颊懈乘斜岑凯趄趴奚伽础乒乓罐粒沓统臀乏旱娃懑沛猴译○汽泳兽赔裹唇券辉煌涮烘障山贬迪忐忑邻聋旋抚蚤淮柳筷誓怂恿杠伍堪审允砰拙冥膝谓监典襟暂喏芭蕾茸泛掺楞咒营鞠琢融井悸诩供帖裆蹚髦匹铅劣匿拟抒耶阻垢罚佬俭雅竞判坦玲衔豆浆逐啰嗦慧隆扩售扉苛肆侧刃陆蜂啊置醋筹刨姿斑纹树仓淘鸟贿赂胃献搡蹭鲛绕刊乳赢枚邓稚幽穆伞叶综攀塑岸揪婿押耀黛玉倡州攥舵翁塌映田季灿噜妻胫琐蚁挪咏珍癞冻妥茅衬涯苗勒染浑晦扳崩夭尚倾搽迫抑辣.唔驾京杭苟咛嗖兔酵蓝褒呐珑趋悚诲裁怦饼傅搓龄巾帼矫毡懊T恤溶娄踊洞幕览揶揄羊H躬猫懵渴哎朗诵渊凉镖羲悯驰栗航喳栖贯暴返彰街垠撞浮炬吱诞暖叼储辟耗熄沿吝骷髅甫洛震敛捷森茶诱饵盐咚梳网谅孜吉憾趿糙俘僻脉猾燕粘遥啤瓦翘拇缕郁脯赚遮曰疗奥液抠阐述倦楔旨韦粹冶迂逛铆凛绒虏奸蒂芬肺疚挫亡逝寞尤嘤昧催俊晒闸杞菲鹤革瑰哗赴衰癖衡铸岗坎坷寂椒姊汲惮践卍'
        alfabet = '0123456789abcdefghijklmnopqrstuvwxyz'
        #alfabet = u"动都教;正澜点真酒两下”没P斯刮太座红2心宝献星e|跳办4顿卫见藻额唠@把叱L分就斟游汪保J来盆饰美冒绣待怕槛K色钺外H起久鞭最5木吃皇礼随喧平争湃F爷l$骂经和火听耳线已（个q世霸蔚地押开哀放低要跟只亮n于橡连加站顶问什板惊用波6_间满几往训运全f、撒期r网东派不值愿找高昏奇巴三希也O咐D双的坎差死厉i揪些叨重果深朝到意哪X面普A气周骚袭却齐推快第s你敢暴3当z难&该身拗忙像话桩去奔士糕国童砖锦穿脾涌宁生苦围1vB金无依啦那花一靴想这划腾膳吩！嚷答珍故旧瓜Za您闹手受(是笨瞧锋新给V凛侍涂违她劳诉孩后条吓更罗蛋住整里王威道事佬房总U黑拖吵让j天贱9；句着W上沉翻渔切勤本坐了守微讲混发仆疯 E指活家台涛光m奴吼严帝赎笑海k妇-儿貂b能行所？酬钱傻）呀殿等0说叫“.'记西水阴c然过唤告：己踪d干走扛马草纺报泥女嘴:戴?纱p斧足愈砌年边脚佑汹。族打门h从/烟前M候肩么Tu洋得娘丈皮风I阶老石自恳子G十xy样今实,抓大夫我g为们敞呵好母他Sw糊8贵式>倒次<滚嘲求别N叩，做回拿口庄会还声人对破乡蓝窗桌o砍白婆影尾臣便结向路害俄竟眼安又跑名澎胡珠惹怎宫暗在#怒囱吧利常偿C7使中休看接由药)成嵌楼可有头戒—亲稼R棚赶Y再变脖鱼t"
        #alfabet = '0123456789abcdefghijklmnopqrstuvwxyz'
        #alfabet = u'abcdefghijklmnopqrstuvwxyz不用留地址了！"洪裳说孩林晓梅三会就把一同过学免除，所以总训斥贾在中国作〉家协第届儿童文明天放他请来思想走暗对吴巧翻到本介绍龙传正认识你很九、生日派巴的回信也得稍拿点架为。要气记-封牵连道下午资料后刀子原那是胡甲级高兴又蹦可还胜早们玩去吧话印象智低着头脸绝望完全像只断翅膀机向惊慌人急匆闯进劈问：友写做字好爸叹口妈摊开忙准上约校大门集合里按读书已经睡几个私拆我给草？切包照张相保证身都少外面业余杯鲜桔水和若干觉喂这插座活雷锋专管老兄起轰动先出逃惭愧么弄副鬼样弯眉达室恳爽快怎填医有些阵整报复杜小求往比宜吗区长风公园妹装庆祝查师题推称号心导打悔满累死惜站边没苦自己王种钢笔习班即怪表情法听却告诉才关眼前算冷百分她笑什难计策名因知祁抄袭事—摘力挽狂澜制止场恶斗十五硬女半伙能时跟父亲多艺术团现毕竟迅速看当民鲁盆兜争论版单位响亮店独缺药仿佛见电脑劳体遇危而之更谈丫真嘴舌叫Yes色调如厨房饭桌间且荐怕冒险定跃成功臣队瘪考托福肯役双戏院云感梨汁…喝差套颜理市越太谨曾美丽姆极任划盗步夺路但与检讨两背爵物敢《威尼斯商》晚夜二拨通片工厂宣布让块混票神支柱旗帜产系周年帽始发挥受哪懂消息灵疯材嘟哝无精采次赛啦手喜欢吃咸住踏铁栅跳重庭希委屈必此偏初赞莎士亚示目光充崇敬造萍唯朋倒英语方清脆嗓似指变服务歌泣行被视然搭霉肩台演忍钱超员频招利逗碰尽量永远再纸条忸怩劫持呀它味痛并未流露何捂角嚎曲顿呢；假赏勇夫男股陈闲察疼反32透秘八选举波舍居悄乐唱抽烟直忘怀课答提够潇洒篮球则世收诗冲排蹲凡瘦户主讲究礼哥概影妙黯找火转贸途红突击意容咧阿伦值至赶挺忠类东西深贻适辅许退稿错寄候便警键卡胖畅刻跑责命令抗拒No飞平客须结挑新凭今虑汉度逻搞宝贝唤接抱常牌熟买卖搅办病艳青呼声需领笨瓜吹每抓紧舞拳恼羞养赠强静坚瞧柬牛皮袋塞海画鸡首蠢滋剪嘻善于足霆垮从互应喔拔助念议乎验四挤效果怒或参加厌该氛谁赖罢否将尖教睬份泼阁练扛车腿铺迁万另别六奇迹等伸微颤宠救皆血痕失揭姓奋移科拜刚Chin迷鱼葱姜热降温疑漏掉孔乙戒界星志实偶拍懒洋构恨入邢补雄略终细随虽掌握词哦设久酸配奖狼呵哈纪性评忽追戴金丝镜战帮乱奶广妖涂眯态毅鼓励粗脚治癫蛤蟆铃具备批顺糊属闹蛮横额章使休乌虚酒胆俞稀松枕忧躺各厉害解散摄克案吼破墙窘吆逢钟蹈滔漂纯展句拼慢脱鞋咳嗽带患音j特众确率部劲江泽压愚堆侠秒夕存司莫牢骚睛立席征联谋杀凶狠秃顶炮较优近积粱丑伤愤疤腾显基耐酬培者雇佣窗傲剩船床予聂耳跻迟脾妇由决坐凑丁省锻炼驳施政纲绉骂朝努悲观振央落抬嘛吵瞌其尘爱投密武严眠耸节嗨般删异弓护敏烧厕质盛凌肢壮牺牲黑板言麻烦灰剧件寻埋伏瞪拉膨胀试幅摇注宏伟标引胸恭送仪式图简君旧偷束藕荷泰戈尔筒华捏惹页孤抹罕根碗喊肚钻靠段慎石袖酝酿谢贵竹财雨淋揉鼻喷漠懦喻贴播腻社豹取甚聊婆最千史犟坏哲咬代徐兼傻忆停涉仙母型仅桩隐军族醒底灭肤白皙搬憋愿掏侦番姐绰故程辑格诚奴隶惋吞吐食敲抢庞阶糟糕盘碎扣普秦冰箱荤菜煮喉咙研畏蔼化肇处玻璃渣踪梦奔零纠躲毫噢库腰共党捡卫魂哭斤顾彼柴叮蔡闷狡黠含裤扫净浅淌汗烈浪朵剑堂骄访泪围磁待临罗蒙毛欣轻埃及塔困预镇伯例刘饶趣哇汪胞胎易南辕北辙遗甩缓胳膊哑袜款月搁非仍拦圆兑垫沙替交讯彩洁荟萃运范空捞爬嚼糖香呃您翟丰棚辆安秀扬玄兮厚舒宽迎聚皱援历藏滑稽踢嚷挡堵败叔庸荣咱噩刷牙斩钉截数欠扑哧源洗职歹徒犹豫衫昏兵径询绊杂繁裙宾摸谦享圾递据饱渐润歪剔折屋肿榜朴素涌餐宴肉冠组织妨元七趟彻软吟韩短博形卷权遵邀钩价棍啼郑煎熬慷慨滚烂忿砖订眨义漓拖莺恰谊轶扔蛋肥升贪寺臂健康攻譬俩谎捶残蛇激期橱续创促品录窍盼扶邮抖搂古呈爆幸亏啪噪烤晕济绢盒河猛耿竖饿冤改继闪夹宅虫Stp惨奈遍野炊砸皇屁履窝晨屉惕孝扎减费列农壳触簸擂奏佩炎坟内膏状丈律左喘碌屡姑娘城OK楚辈邱墩骑悉木拘阅纺辨串脏楼筋销恢燃吸岁限局货离担幻依廊某嗯扒巫承锁拾游枪擒敌纳米换贩摆阔肌弹灯笼挂编盾陶醉沉浸致李扭谍馁建筑码嘀咕惠勤哨陪垂丧默秋苏矛借载阴阳篇沾飘犯括尴尬愁肠忌剂燎泡狭窄马诸境怔探卓右弟贼器晃蜷津猪肝紫操辞俯卧撑详庇擞狗兢尝圈屑嫌索酷付维秩序甜溜锐拎灾祸哼锦蠕睁沸锅盖贺衷毒恐慕蓉获炒矢禁闭吁（豁势亿修饰层寿油俱荒尾育肖拯肃末曝怅棒籍踮坯措勃粉舟敞婉况狈憎搜刮释嫩愉旅规矩呆熊线哐猜缘鸦雀乖跺甘踹婶芮杰恒汇碟乍披技羡馆翔惯宋楷皂核娱伊r挨启稳偿铜貌煞寸尊延搔描淡佼缩固执倍痴景衣顽堡垒唠鄙哀端擦枝悦疙瘩梆犒蔑勾弱瘾驶舅花溢妄缝模叙守坑豪迈佯嘘宁既穿柄舆纱荡弃疾摔惴磨链吓肘颗夸污撒y轮凳惟踩蚂惧幼雌昂闻董瑞峻杳眸聪颖瞒霹雳漫仑废嗬瞻慰恋辩挠仔喇叭缠馊郊沫浓拥踱负徕愣堕讳湿漉吻鸣薄潦啃拭庄赤歉腹涎趁叉翩拐绿欲僵郎误摞侄冬怵官添矿泉舰帐帅曹罪魁羽损簿宿怨嘿榨陌蒜脊矮叽寒怜召悟齐姗档违池晶椅吩咐瞥焦嘲揍抡gl篓唬赦辛盲椰垃咄逼巷输控欺侮隔骨虎潮炸遭岔乡栏蹑霎眶盈驻u鼠谜扮梭归诀刺针颠躁枉症廉苍射蚊奢侈卸腔轩劝携）擅占臭1蜜魏篆绪赋傍瘫挣魄群捅锤噼捆赫祟哄搏捣仇橙黄扰霍麦防悠嗷增娑箭啸勉丢疏咖啡涨弛屏惑拢著宇宙瓶绽佑裱捧申登鸭册捺春伪棵咋测恪诺殷叨剥跨缭耍估巡E壁娇聘银灌锲爹鼎避捉饮烫骗揽绩谣益萨佐奉拄昆炯吊纷纤巨祖佳耻辱脖旁摩蹄讽署良帝撇睽琅抵倚掀兰·德雪毁厅沮赌岂渡萝卜殊循昨土跌宕趔颓扯勿扁桃腺斟酌陷齿柔蜇挖芒际掖宗诧恩慈签杆狐绵箍荫潜刹肋涤墨徽晴羹诌蓬富蛛购项析汤韧f唉滴抛旦嚓颊懈乘斜岑凯趄趴匕伽础乒乓沓统臀乏旱娃诡懑奚沛猴译○汽泳兽赔唇券辉煌讶鹃涮烘障山贬迪忐忑邻聋旋抚蚤淮粒柳筷誓怂恿杠伍堪审允砰拙冥捐膝谓监典襟暂喏芭蕾茸泛掺楞咒营鞠琢融井悸诩供帖裆蹚髦匹铅劣匿抒阻垢罚俭雅竞判坦玲衔逐啰嗦扩售扉拟苛肆侧刃陆蜂啊附置醋筹刨姿斑纹树仓佬淘鸟贿赂胃贡献搡蹭鲛绕刊乳赢枚邓稚幽穆伞叶综攀塑岸揪婿押耀黛玉倡州攥舵塌映田季灿噜妻胫琐蚁挪翁咏珍癞冻妥茅衬涯苗勒浑晦扳崩慧夭尚耶倾搽迫抑.唔京杭苟咛嗖蜡烛兔酵蓝褒呐珑趋辣悚诲隆裁怦豆浆饼傅搓龄巾帼矫毡染懊T恤溶娄踊洞幕览揶揄裹羊H躬猫懵渴罐卍'        
        #alfabet = u' 0123456789abcdefghijklmnopqrstuvwxyz/不用留地址了！"洪裳说孩林晓梅三会就把一同过学免除，所以总训斥贾在中国作家协第届儿童文明天放他请来思想走暗对吴巧翻到本介绍龙传正认识你很九、生日派巴的回信也得稍拿点架为。要气记-封牵连道下午资料后刀子原那是胡甲级高兴又蹦可还胜早们玩去吧话印象智低着头脸绝望完全像只断翅膀机向惊慌人急匆闯进劈问：友写做字好爸叹口妈摊开忙准上约校大门集合里按读书已经睡几个私拆我给草？切包照张相保证身都少外面业余杯鲜桔水和若干觉喂这插座活雷锋专管老兄起轰动先出逃惭愧么弄副鬼样弯眉达室恳爽快怎填医有些阵整报复杜小求往比宜吗区长风公园妹装邱士力肩恨能当场跟庆祝查师题推称号心导打悔满累死惜站边没苦自己王种钢笔习班即怪表情法听却告诉才关眼前算冷百分她笑什难计策名因知祁抄袭事—摘挽狂澜制止恶斗十五硬女半伙时父亲多艺术团现毕竟迅速看民鲁盆兜争论版单位响亮店独缺药仿佛见电脑劳体遇危而之更谈丫真嘴舌叫Y色调如厨房饭桌间且荐怕冒险定跃成功臣队瘪考托福肯役双戏院云感梨汁…喝差套颜理市越太谨曾美丽姆极任划盗步夺路但与检讨两背爵物敢《威尼斯商》晚夜二拨通片工厂宣布让块混票神支柱旗帜产系周年帽始发挥受哪懂消息灵疯材青嘟哝无精采掉另再次赛啦手喜欢吃咸住踏铁栅跳重庭希委屈必此偏初犯赞莎亚示目光充崇敬造萍唯朋倒英语牢骚舍懒方清脆嗓似指变服务歌泣行被视然搭霉台演忍钱超员频招利逗碰尽量永远纸条忸怩劫持呀它味痛并未流露何捂角嚎曲刚摸验顿呢；假赏勇夫男折扣笨瓜股陈闲察疼反32透秘顺挂悄八选举波居乐唱抽烟直忘怀课答提够潇洒篮球则世收诗冲排蹲凡瘦户主讲究礼哥概影妙黯找火转贸途红突击意容咧阿伦值至赶挺忠类东西深贻适辅许退稿错寄候便警键卡胖畅刻跑责命令抗拒N飞平客须结挑新凭今虑汉度逻搞宝贝唤接抱常牌熟买卖搅办病艳呼声需领吹每抓紧舞拳恼羞养赠谢千金强静坚瞧柬牛皮袋塞海画鸡首蠢滋剪嘻善于足霆垮从互应喔拔助念议乎四挤效果怒或参加厌该氛谁赖罢否将尖教睬份泼阁练扛车腿铺迁万别六奇迹根等伸微颤宠救皆血痕失揭姓奋移科拜C迷鱼葱姜热降温疑漏孔乙戒界星志实偶拍洋构入邢补雄略终细兵剑存随虽掌握词哦设久酸配奖狼呵哈纪性评忽追戴丝镜战帮乱奶广妖涂眯态毅鼓励敏粗脚治癫蛤蟆铃具备批糊属闹蛮横额章使休乌虚酒胆俞稀松枕忧躺各厉害解散摄克案注立吼破墙窘吆逢钟蹈滔漂纯展句拼慢脱鞋咳嗽带患音特众确率部劲江泽压愚堆侠秒夕司莫睛席征联谋杀凶狠秃顶炮较优近积粱丑伤愤疤腾显基耐酬培者雇佣窗傲剩船床予愿聂耳跻迟脾妇由决坐凑丁署省锻炼驳施政纲绉骂朝努悲观振央落抬嘛吵瞌其尘爱投密武严眠耸节嗨般删异弓护烧厕质盛凌肢壮牺牲黑板言费麻烦灰剧件寻埋伏瞪拉膨胀试幅摇叔伯堂姐宏伟标引胸恭送仪式图简咖啡君旧偷束藕荷泰戈尔筒华捏抖搂惹页孤抹罕碗喊肚钻靠段慎石袖酝酿贵竹祸财雨淋揉鼻喷漠懦喻贴播腻社豹取甚聊婆最史犟坏哲咬代徐兼傻忆停涉仙捡母型仅桩隐军族醒底灭肤白皙搬憋掏侦番绰故程辑格诚奴隶惋吞吐食减寿敲抢庞阶糟糕盘碎普秦冰箱荤菜煮喉咙研铜畏蔼化肇处玻璃渣踪梦奔零纠躲毫噢库腰盼共党卫魂哭斤顾彼柴叮蔡闷狡黠含裤扫净浅骄淌汗烈浪朵访泪围磁待临罗蒙毛欣轻埃及塔困预廊镇例刘饶趣哇汪胞胎易南辕北辙遗甩缓胳膊哑袜款月毁撑搁非仍拦圆兑垫沙替交讯彩洁荟萃运范空捞爬嚼糖香呃您翟丰棚辆安秀扬玄兮厚舒宽迎聚皱援历藏蜡烛吩咐滑稽踢嚷挡堵败庸荣咱噩刷牙斩钉截数欠扑哧源洗职歹徒犹豫衫昏径询绊杂繁裙宾谦享圾递据饱渐润歪剔屋肿榜朴素涌餐宴肉冠组织妨元七趟彻软吟韩短博形卷权遵邀钩价棍啼郑煎熬慷慨滚烂忿砖订眨义漓拖莺恰谊轶扔蛋肥升贪寺臂健康攻譬俩谎捶残蛇哼激期橱续创促品录窍扶邮古呈爆幸亏啪噪烤晕济绢盒河猛耿承竖饿冤改继闪夹宅虫S惨奈遍野炊砸皇屁履窝晨屉惕孝扎列农壳隔触簸擂奏佩炎坟内膏状丈律左喘碌屡姑娘城OK楚辈墩骑锈悉木拘阅纺辨串污蔑脏楼筋销恢燃吸岁限局货离担幻依某嗯扒巫锁拾游枪擒敌纳米换贩摆阔肌弹灯笼编盾陶醉沉浸致李扭谍馁建筑码鹃既嘀咕惠勤哨陪垂丧默况秋苏矛借载阴阳篇沾飘括尴尬愁肠忌剂燎泡狭窄马诸境怔探卓右弟贼器晃蜷津猪肝紫操辞俯卧详庇擞狗兢尝圈屑嫌索酷付维秩序甜溜锐拎灾貌锦蠕睁沸锅盖贺衷毒恐慕蓉获炒矢禁闭吁（豁势亿修饰层惯油俱荒尾育肖拯肃末曝怅棒籍踮坯措勃粉舟敞婉狈憎搜刮释嫩愉旅规矩呆熊线哐猜缘鸦雀乖跺甘踹婶芮杰恒汇碟乍披技羡馆翔宋楷耻册皂核娱伊挨启稳偿煞寸尊延搔描淡佼缩固执倍痴景衣顽堡垒唠鄙哀端擦枝悦疙瘩梆犒勾弱瘾驶舅花溢妄缝模叙守坑豪迈佯嘘宁穿柄舆纱荡弃疾摔惴磨链吓肘颗夸撒轮凳惟踩蚂惧幼雌昂闻董瑞峻杳眸聪颖瞒霹雳漫仑废嗬瞻慰恋辩挠仔喇叭缠馊郊沫浓拥踱负徕愣堕讳湿漉吻鸣薄潦啃拭庄赤歉腹涎趁叉翩拐绿欲僵郎误摞侄冬怵官添矿泉舰帐帅曹罪魁羽损簿宿怨嘿榨陌E蒜脊矮叽寒怜召悟齐姗档违池晶椅瞥焦嘲揍抡篓唬赦辛盲椰垃咄逼巷输控欺侮骨虎潮炸遭岔乡栏蹑霎眶盈驻鼠谜捐扮梭归诀刺针颠躁枉症廉苍射蚊奢侈卸腔轩劝携）擅占臭1蜜魏篆绪赋傍瘫挣魄群捅叨锤噼捆赫祟哄捣搏仇橙黄扰霍麦防悠嗷增娑箭啸勉丢疏涨弛屏惑拢著宇宙瓶绽佑裱捧申登鸭捺春伪棵咋测恪诺殷刹剥跨缭耍估巡壁娇聘银灌锲爹鼎避捉匕饮烫骗揽绩谣益萨佐奉拄昆炯吊纷纤巨祖佳辱脖旁摩附蹄讽讶良帝撇诡睽琅抵倚掀兰·德雪厅沮赌岂渡萝卜殊循昨土跌宕趔颓扯勿扁桃腺斟酌陷齿柔蜇挖芒际掖贡宗诧恩慈签杆狐绵箍荫潜肋涤墨徽晴羹诌蓬富蛛购项析汤韧唉滴抛旦嚓颊懈乘斜岑凯趄趴奚伽础乒乓罐粒沓统臀乏旱娃懑沛猴译○汽泳兽赔裹唇券辉煌涮烘障山贬迪忐忑邻聋旋抚蚤淮柳筷誓怂恿杠伍堪审允砰拙冥膝谓监典襟暂喏芭蕾茸泛掺楞咒营鞠琢融井悸诩供帖裆蹚髦匹铅劣匿拟抒耶阻垢罚佬俭雅竞判坦玲衔豆浆逐啰嗦慧隆扩售扉苛肆侧刃陆蜂啊置醋筹刨姿斑纹树仓淘鸟贿赂胃献搡蹭鲛绕刊乳赢枚邓稚幽穆伞叶综攀塑岸揪婿押耀黛玉倡州攥舵翁塌映田季灿噜妻胫琐蚁挪咏珍癞冻妥茅衬涯苗勒染浑晦扳崩夭尚倾搽迫抑辣.唔驾京杭苟咛嗖兔酵蓝褒呐珑趋悚诲裁怦饼傅搓龄巾帼矫毡懊T恤溶娄踊洞幕览揶揄羊H躬猫懵渴哎朗诵渊凉镖羲悯驰栗航喳栖贯暴返彰街垠撞浮炬吱诞暖叼储辟耗熄沿吝骷髅甫洛震敛捷森茶诱饵盐咚梳网谅孜吉憾趿糙俘僻脉猾燕粘遥啤瓦翘拇缕郁脯赚遮曰疗奥液抠阐述倦楔旨韦粹冶迂逛铆凛绒虏奸蒂芬肺疚挫亡逝寞尤嘤昧催俊晒闸杞菲鹤革瑰哗赴衰癖衡铸岗坎坷寂椒姊汲惮践卍'
        #alfabet = u' ，的。一是0不在绉有、人“”了中国大为1:上2这个以年生和我时：之也来？到要会学对业出行；公能他于5e3而发地可作就自们后成家日者分多下其用方本得子.高4过经6现说与前o理工所力t如将军部,事进9司场同机主都实天面市8ia新动开n关定还长此月7道美心法最文等当第好然体全比股通性重三外s但战;相从你r内无考因小资种合情去里化次入加间些度?员意没产正表很队报已名海点目着应解那看数东位题利起二民提及明教问）制期（元游女-并曰十果)么注两专样信王平己金务使电网代手知计至常(只展品更系科门特想西l水做被北由c》万老向《记政今据量保建物区管见安集或认程h总—少身先师球价空旅又求校强各非立受术基活反!世何职导任取式[]试才结费把收联直规持赛社四山统投南原该院交达接头打设每别示则调处义权台感斯证言五议d给决论她告广企格增让指研商客太息近城变技医件几书选周备m流士京传u放病华单话招路界药回再%服什改育口张需治德复准马习真语难始"际观完标共项容级即必类领AC未w型案线运历首风视色尔整质参较云具布组办气造争往形份防p它车深神称g况推越英易且营条消命团确S划精足儿局飞究功索走望却查武思兵识克故步影带乐白源史航志州限清光装节号转图根省许引势失候济显百击f器象效仅爱官包供低演连夫快续支验阳男觉花死字创素半预音户约率声请票…便构T存食y段远责M拉房随断极销林亚隐超获升B采I算益优愿找按维态满尽令汉委八终训值负境练母热适江住列举景置黄听除读众响友助弹干孩边李六甚罗致施模料火像古眼搜离D闻府章早照速录页卫青例石父状农排降千P择评疗班购属革够环占养曾米略站胜①核否独护钱/红范另须余居虽毕攻族吃喜陈G轻亲积星假b县写刘财亿某括律酒策初批普片协售乃落留岁突双绝险季谓严村E兴围依念苏底压破河怎细富切乎待室血帝君均络牌陆印层斗简讲买谈纪板希聘充归左测止笑差控担杀般朝监承播k亦临银尼介v博软欢害七良善’移土课免射审健角伊欲似配既拿刚绩密织九编狐右龙异若登检继析款纳威微域齐久宣阿俄店康执露香额紧培激卡短群②春仍伤韩楚缺洲版答O修媒秦‘错欧园减急叫诉述钟遇港补N·送托夜兰诸呢席尚福奖党坐巴毛察奇孙竞宁申L疑黑劳脑R舰晚盘征波背访互败苦阶味跟沙湾岛挥礼F词宝券虑徐患贵换矣戏艺侯顾副妇董坚含授皇付坛皆抗藏潜封础材停判吸轮守涨派彩哪笔．﹑氏尤逐冲询铁W衣绍赵弟洋午奥昨雷耳谢乡追皮句刻油误宫巨架湖固痛楼杯套恐敢H遂透薪婚困秀帮融鲁遗烈吗吴竟③惊幅温臣鲜画拥罪呼警卷松甲牛诺庭休圣馆_退莫讯渐熟肯V冠谁乱朗怪夏危码跳卖签块盖束毒杨饮届序灵怀障永顺载倒姓丽靠概输货症避寻丰操针穿延敌悉召田稳典吧犯饭握染怕端央阴胡座著损借朋救库餐堂庆忽润迎亡肉静阅盛综木疾恶享妻厂杂刺秘僧幸扩裁佳趣智促弃伯吉宜剧野附距唐释草币骨弱俱顿散讨睡探郑频船虚途旧树掌遍予梦圳森泰慢牙盟挑键阵暴脱汇歌禁浪冷艇雅迷拜旦私您④启纷哈订折累玉脚亮晋祖菜鱼醒谋姐填纸泽戒床努液咨塞遭玩津伦夺辑癌x丹荣仪献符翻估乘诚K川惠涉街诗曲孔娘怒扬闲蒙尊坦=衡迪镇沉署妖脸净哥顶掉厚魏旗兄荐童剂乏倍萨偏洗惯灭径犹趋拍档罚纯洛毫梁雨瑞宗鼓辞洞秋郎舍蓝措篮贷佛坏俗殊炮厅筑姆译摄卒谷妈聚违忘鬼触丁羽贫刑岗庄伟兼乳叶凡龄宽峰宋硬岸迅喝拟雄役零舞暗潮绿倾详税酸徒伴诊跑吾燕澳啊塔宿恩忙督末⑤+伐篇敏贸巧截沟肝迹烟勇乌赞锋返迫凭虎朱拔援搞爆勤抢敬赶抱仁秒缓御唯缩尝贴奔跨炎汤侵骑励戴肤枪植瘤埃汽羊宾替幕贝刀映彻驻披抓奉抵肿麻U炸繁赢茶伏梅狂忧豪暂贾洁绪刊忆桥晓册漫圆默妾侧址横□偶狗陵伙杜忍薄雪陷仙恋焦焉烦甘腺颇赏肠废墙债艾杰残冒屋堡曹储莱挂纵孝珍麦逃奋J览镜缘昭摆跌胁昌耶腹偿蛋盈瓦摩沈惟迁冰辛震旁泉圈巡罢泛穷伸曼滋丈颜勒悲肥郭混灯租⑥鸡阻邑伍践驾魔X拒懂糖脏沿翁胆惧聊携晨滑菌辅贤鉴丝尾赴吨宇眠脂籍彼污貌弄郡【奶菲烧垂壮浮弗赖】珠迟渠寿隆剑胞跃稍愈荷壁卿邦忠摇悟锦扰袭盾艘浓筹盗哭淡孕扣呈怨琳孤奴驱振闭～隔寒汝贯恢饰荡姑械*猛亏锁硕舒嘉宏劲帅誉番惜胸抽脉孟遣碍辆玄陶丧矿链矛鸟夷嘴坡吕侦鸣妹邓钢妙z欣骗浙辽奏唱腐仆祝冬韦邮酬尺涯毁粉井腰肌搭恨乙勿婆★闹猎厉哀递廉卧豆揭瓶⑦蒋忌贡邀覆墓捷Q骂芳耗奈腾抑牵履绕睛炼描辉肃循仿葬漏恰殿遥尿凯仲婢胃翼卢慎厦颈哉疲惑汗衰剩昆耐疫霸赚彭狼洪枚媪纲窗偷鼻池磨尘账拼榜拨扫妆槽蔡扎叔辈―泡伪邻锡仰寸盐叹囊幼拓郁桌舟丘棋裂扶逼熊轰允箱挺赤晶●祭寄爷呆胶佩泪沃婴娱霍肾诱扁辩粗夕灾哲涂艰猪Y铜踏赫吹屈谐仔沪殷辄渡屏悦漂祸赔涛谨赐劝泌凤庙墨寺淘勃崇灰虫逆闪竹疼旨旋蒂⑧悬紫慕贪慧腿赌捉疏卜漠堪廷氧牢吏帕棒纽荒屡戈氛黎桃幽尖猫捕嫁窃燃禽稿掩踪姻陪凉阔碰幻迈铺堆柔姿膜爸斤轨疆丢仓岂柳敦祥栏邪魂箭煤惨聪艳儒&仇徽厌潘袖宅恒逻肺昂炒醉掘宪摸愤畅汪贺肪撑桂耀柏韂扑淮j凌遵钻摘碎抛匹腔纠吐滚凝插鹰郊琴悄撤驶粮辱斩暖杭齿欺殖撞颁匈翔挤乔抚泥饱劣鞋肩雇驰莲岩酷玛赠斋辨泄姬拖湿滨鹏兽锐捧尸宰舆宠胎凶割虹俊糊兹瓜悔慰浦锻削唤戚撒冯丑亭寝嫌袁⑨尉芬挖弥喊纤辟菩埋呀昏傅桑稀帐添塑赋扮芯喷夸抬旺襄岭颗柱欠逢鼎苗庸甜贼烂怜盲浅霞畏诛倡磁茨毅鲍骇峡妨雕袋裕哩怖阁函浩侍拳寡鸿眉穆狱牧拦雾猜顷昔慈朴疯苍■渴慌绳闷陕宴辖「」舜讼柯丞姚崩绘枝牲涌虔姜擦桓逊汰斥﹒颖悠恼灌q梯捐∶挣衷啡娜旬呵刷帽岳豫咖飘臂寂粒募嘱蔬苹泣吊淳诞诈咸猴~奸淫佐晰崔雍葛鼠爵奢仗涵淋挽敲沛蛇锅庞朵押鹿滩祠枕扭厘魅⑩湘柴炉荆卓碗夹脆颠窥逾诘贿虞茫榻碑傲骄卑×Z蓄煮劫卵碳痕攀搬拆谊禹窦绣叉爽肆羞爬泊腊愚牺胖弘秩娶妃柜觽躲葡浴兆滴衔燥斑挡笼徙憾垄肖溪叙茅膏甫缴姊逸淀擅催丛舌竭禅隶歧妥煌玻刃☆肚惩赂耻詹璃舱溃斜祀翰汁妄枭萄契骤醇泼咽拾廊犬筋扯狠挫钛扇蓬吞帆戎稽娃蜜庐盆胀乞堕趁吓框顽硅宛瘦剥睹烛晏巾狮辰茂○裙匆霉杖杆糟畜躁愁缠糕峻贱辣歼慨亨芝惕娇⑾渔冥咱栖浑禄帖巫喻毋泳饿尹穴沫串邹厕蒸＋滞铃寓萧弯窝杏冻愉逝诣溢嘛兮暮豹骚跪懒缝盒亩寇弊巢咬粹冤陌涕翠勾拘侨肢裸恭叛纹摊#兑萝饥>浸叟滥灿衍喘吁晒谱堵暑撰棉蔽屠讳庶巩钩丸诏朔瞬抹矢浆蜀洒耕虏诵陛绵尴坤─尬搏钙饼枯灼饶杉盼蒲尧俘伞庚摧遮痴罕桶巷乖{啦纺闯→敛弓喉酿彪垃歇圾倦狭晕裤蜂}垣莉谍俩妪⑿钓逛椅砖烤熬悼倘鸭馈惹旭薛诀渗痒蛮罩渊踢崖粟唇辐愧玲遏昼芦纣琼椎咳熙钉剖歉坠誓啤碧郅吻莎屯吟臭谦刮掠垫宙冀栗壳崛瑟哄谏丙叩缪雌叠奠髃碘暨劭霜妓厨脾俯槛芒沸盯坊咒觅剪遽贩寨铸炭绑蹈抄阎窄冈侈匿斌沾壤哨僵坎舅洽勉侣屿啼侠枢膝谒砍厢昧嫂羡铭碱棺漆睐缚谭溶烹雀擎棍瞄裹曝傻旱坑驴弦贬龟塘贞氨盎掷胺焚黏乒耍讶纱蠢掀藤蕴邯瘾婿卸斧鄙冕苑耿腻躺矩蝶浏壶凸臧墅粘⒀魄杞焰靶邵倚帘鞭僚酶靡虐阐韵迄樊畔钯菊亥嵌狄拱伺潭缆慑厮晃媚吵骃稷涅阪挨珊殆璞婉翟栋醋鹤椒囚瞒竖肴仕钦妒晴裔筛泻阙垒孰抖衬炫兢屑赦宵沮谎苟碌屁腕沦懈扉揖摔塌廖铝嘲胥曳敖傍筒朕扳鑫硝暇@冶靖袍凑悍兔邢熏株哮鹅乾鄂矶逵坟佣髓隙惭轴掏苛偃榴⒁赎谅裴缅皂淑噪阀咎揽绮瞻谜拐渭啥彦遁琐喧藉嫩寞梳溜粥恤迭瀑蓉寥彬俺忿螺膀惫扔匪毙怠彰啸荻逮删脊轩躬澡衫娥捆牡茎秉俭闺溺萍陋驳撼沽僮厥沧轿棘怡梭嗣凄℃铅绛祈斐箍爪琦惶刹嗜窜匠锤筵瑶幌捞敷酌阜哗聂絮阱膨坪歪旷翅揣樱甸颐兜頉伽绸拂狎颂谬昊皋嚷徊⒂曙麟嚣哑灞钧挪奎肇磊蕉荧嗽瓒苯躯绎鸦茵澜搅渺恕矫讽匀畴坞谥趟蔓帛寅呜枣萌磷涤蚀疮浊煎叮倩拯瑰涩绅枉朽哺邱凿莽隋炳睁澄厄惰粤黯纬哦徘炜擒捏帷攒湛夙滤浐霄豁甄剔丫愕袜呕|蹲皱勘辜唬葱甩诡猿稻宦姨橡涧亢芽濒蹄窍譬驿拢叱喂怯坝椰孽阖瞩萎镑簿婷咐郸瑜瑚矮祷窟藩牟疡仑谣侄沐孜劈枸妮蔚勋玫虾谴莹紊瓷魁淄扛曩柄滔缀闽莞恳磅耸灶埠嚼汲恍逗畸翩甥蚁耽稚戟戊侃帜璧碟敞晖匙烫眷娟卦寐苌馨锣谛桐钥琅赁蜡颤陇僻埔腥皎酝媳⒃翘缔葫吼侮淹瘫窘啖犀弒蕾偕笃栽唾陀汾俨呐膳锌瞧骏笨琢踩濮黛墟蒿歹绰捍诫漓篷咄诬乓梨奕睿嫡幢砸俞亟捣溯饵嘘砂凰丕荥赀薇滕袱辍疹泗韧撕磕梗挚挠嫉奚弩蝉罐敝鞍晦酣搁柿菠卞煞堤蟹骼晤娡潇胰酱郦脖檐桩踵禾狩盏弈牒拙喇舶炊喀黔挟钞缕俏娄粪颅锏凹饲肘赟吝襟琪谕飙秽颊渝卯捡氢桀裳滇浇礁◎蚊芙荀吩凳峨巍雉郢铲倪杳汹豚乍蛙驼嗅讫痰棵睫绒捻罔杠氟堰羁穰钠骸睾鳞邸於谧睢泾芹钾颓Ⅱ笋橘卉岐懿巅垮嵩柰鲨涡弧◆钝啃熹芭隅拌锥抒焕漳鸽烘瞪⒄箕驯恃靴刁聋剿筝绞鞅夯抉嘻弛垢衾丐斟恙雁匮娼鞠扼镶樵菇兖夭戌褚渲硫挞衙闫绾衅掣磋袒龚叨揉贻瑛俾薯憎傣炬荤烁沂粑蚌渣茄荼愍蒜菱狡蠡戍畤闵颍酋芮渎霆哼韬荫辙榄骆锂肛菑揪皖秃拽诟槐髦脓殡闾怅雯\戮澎悖嗓贮炙跋玮霖皓煽娠肋闸眩慷迂酉赘蝇羌蔑氯蚕汀憋臾汕缸棚唉棕裟蚡驮簇橙〉蹇庇佼禧崎痘芜姥绷惮雏⒅恬庵瞎臀胚嘶铀靳呻膺醛憧嫦橄褐讷趾讹鹊谯喋篡郝嗟琉逞袈鲧虢穗踰栓钊鬻羹掖笞恺掬憨狸瑕匡〈痪冢梧眺佑愣撇阏疚攘昕瓣烯谗隘酰绊鳌俟嫔崭妊雒荔毯纶祟爹辗竿裘犁柬恣阑榆翦佟钜札隧⒆腌砌酥辕铬痔讥毓橐跻酮殉哙亵锯糜壬瞭恻轲糙涿绚荟梢赣沼腑朦徇咋膊陡骋伶涓芷弋枫觑髻巳匣蠕恪槟栎噩葵殃淤诠昵眸馁奄绽闱蛛矜馔遐骡罹遑隍拭祁︰霁釜钵栾睦蚤咏憬韶圭觇芸氓伎氮靓淆绢眈掐簪搀玺镐竺峪冉拴忡卤撮胧邛彝楠缭棠腮祛棱睨嫖圉杵萃沁嬉擂澈麽轸彘褥廓狙笛彗啬盂贲忏驺悚豨旌娩扃蹦扈凛驹剃孺〕吆驷迸毗〔熔逍癸稼溥嫣瓮胱痊逡疟苻曪拣戛臻缉懊竣囤侑肽缮绥踝壑娴猝焻禀漱碁蹬祗濡挝亳萦癖彀毡锈憩筷莒噬珀砝鬓瑾澧栈恚搓褒疤沌絷镖塾钗骊拷铂郄窒驸裨矗烙惬炖赍迥蹴炽诧闰糯捅茜漯﹐峭哇鹑疵梓骠咫鹦檀痹侥蘑衢灸琵琶懦邺扪痿苔拇腋薨馅雠敕捂鴈栅瓯嘿溉胳拎巿赃咕诃谤舁禺榨–拈瘙眯篱鬟咯抨桨岱赡蹶惚嗔喏聆曜窑瘢柠蕃寤攫饷佬臼皈蟒啜蔗汶酪豕窖膛檬戾蟠黍鲸漾猾驭踊稠脯潍倭谑猖聒骞熄渍瞳蒯陉褪筐彤蝴廪嬴沱闼橱蜚蹭鄢臆邳盔眶沓飨覃彷淌岚霹辔袂嗤榔鸾綦莘媲翊雳箸蚩茸嗦楷韭簸帚坍後璋剽渤骥犊迩悯饪搂鹉岑觞棣蕊诳黥藻郜舵毂茗忱铿谙怆钳佗瀚亘铎咀濯鼾酵酯麾Ⅰ笙ü缨翳龈忒煦顼俎圃刍喙羲陨嘤梏颛蜒啮镁辇葆蔺筮溅佚匾暄谀媵纫砀悸啪迢瞽莓瞰俸珑骜穹麓潢妞铢忻铤劾樟俐缗煲粱虱淇徼脐鼋嘈悴捶嚏挛谚螃殴瘟掺〇酚梵栩褂摹蜿钮箧胫馒焱嘟芋踌圜衿峙宓腆佞砺婪瀛苷昱贰秤扒龁躇翡宥弼醮缤瘗鳖擞眨礶锢辫儋纭洼漕飓纂繇舷勺诲捺瞑啻蹙佯茹怏蛟鹭烬■兀檄浒胤踞僖卬爇璀暧髡蚂饽镰陂瞌诽钺沥镍耘燎祚儣莺屎辘鸥驩氐匕銮━苴憔渥袅瞿瓢痣蘸蹑玷惺轧喃潺唏逅懵帏唠徨咤抠蛊苇铮疙闳砥羸遨哎捽钏壹昇擢贽汴砰牝蔼熠粽绌杼麒叭颔锭妍姒邂濞轶搔蹊阂垦猕伫瘩璐黠婺噫潞呱幡汞缯骁墩赧瞥媛瞠羔轼Ⅲ拗鹞搴诮趴凋撩芥缎摒泮惘骛瘳姝β渚吠稣獘篃罄吒茧黜缢獗诅絜蜕屹哽缄俑坷杓剁锺鹜谩岔籽磬溍邃钨甬笥蝠龋鸱孚馍溴妫偎烽椽阮酗惋牍觥瞅涣狈锰椟饺溲谪掇蓟倔鞫猢笄翕嗥卺寰狞洮炕夡瘠磺肱奭耆棂娅咚豌樗诩斡榈琛狲蕲捎戳炯峦嘎睬怙疱霎哂鱿涸咦痉$抟庖沅瑙珏祜楞漉鸠镂诰谄蜗嗒珂祯鸳殒潼柩萤柑轵缰淼冗蕙鳄嘀彊峥雹藜笠岖傥潦苞蛰嬖僦碣裰疸湮昴榷涎攸砾跖恂舄麝貂孢捋笈璨粕浚鹃歆漪岷咧殁篆湃侏傈殇霭嚎拊崂鬲碉菁庾拚旃幺皿焊噢祺锚痤翎醺噶傀俛秧谆僳菽绯瘥盥蹋髯岌痧偌禳簧跤伉腼爰箫曦蜘霓愆姗陬楂嵘蜓浼癫瓠跷绐枷墀馕盹聩镯砚晁僊°坂煜俚眛焘阍袄夔馋泸庠毐飚刭琏羿斓稔阉喾恸耦咪蝎唿桔缑诋訾迨鹄蟾鬣廿莅荞槌媾愦郏淖嗪镀畦颦浃牖襁怂唆嚭涟拮腓缥郫遴邾悒嗝殽跛掂撬鄣鄱斫窿兕壕疽铙吱厩甭镪篝踣眦啧糠鲤粲噱椭哟潸铆姣馥胙迦偻嗯陟爲桧鸯恿晌臱骈喽淅澹叽桢刨忑忐猩蝙旄晾吭荏觐胄榛豢堑帔咙柚僭锵√肮囿忤惴燮棹摈缈幛墉诎仞剌氇泯茱獾豺蜃殂窈倨褓詈砷邕薰頫焖痫痢掾獐簌雎é帧鸩匝桅椁绫桡氆哌咛鞘辎缙玑佤垓槿蛤烨泓罴鄜褶瘀颌蹂弑珪曷膑惦咆梆蛾牂髅捱拧婧踱怵侗屉讪衲麋宕畿唧怛豉籁觌舂蓦廨胪怍鄄绶飕蜻欷邬杲汧唑冽邰鼍魇铐哝泱扞飒醴陲喟筠殓瘸倏嗳啕睑翌à幄娓蓺妩奁璜桦朐榕礴儡婕觎觊绦猥涮倬袤啄掳椿俪噜摞※鄗漩悝淞袴僇酹搒跽鳍疣姁猗舛鞮砭郯徕纥梃卮肣湎怦揄迕芍珥羚喔缁涝栉犷汜悻呛赭淬泫炀箴镌髫拄怔炷桎巽汭鹫挈蝄噙锄邴歔瘪腴呗慵撺欤阡傩苫掰盅冑躏茉霾耄楹蹻苋鲠哆傒榭牦婶仃囱皙醦隰掼琖駆暲砒舀鹗犒斛甑楫嫪胭瘁铛藕簋腭睽阕裀砧蓼贳劬搽龏荃奘祎泵攥翱晟酎睇逋箔羟诙饬跆眇佻铠娑郧葭蝗郓幞鉏碾硒釉磔殄藐莠颧熨獠浞笺癣茬衽喳裾倜鸢蠹廛惆芈燔伛妗佃缜咣龛挎徵粼锉啾隼猬镳璇胯饕揩縠虮苓噎祓筰奂搪喁俦隗馏圩褫僰吮哧湫旻筏搢佶茕铣娆揍嗷柈蕨绖旎汨畑鳏厝溷楯卅祇′怼焯±柘骷澍▲`珞褊╱痂罘殚垠缧瑁齮蓐怿蹿豳犴孵筱蜷窋泞肄祐窕酆谶阗讙镝匍腱^镬仡樾驽峒蟆葳徉昙罡耜嗨氲骅襦浔纮洱氦舐黙臊縯汛蹀溟枥祉铄豸揶馀闇呷仄焒嗡崆匳皑匐÷诿髭鲰鲲筴侬鹳滂△橹邈弭弁樽揆幔纨踉帼跸搠缞氤旒旖屣孱槁铉榼沣娣娈夤壅枇讴埶阆杷浣狰愠蚓咿藿欻萸刽稞刎骖冁骰嵯濂跚湄釂麤珰舔谮坨嗲埒锲鲇煨耎绻楣噉谟嗖裆晗囹黝讣薏⑴貉椹蟜犍蜇秏呶箩悞妤搐芪呦恽赊侩绁猱遒镵鸮趺簏迤坼痼棰凫诂骀瘴螨阚臃葩篓谲悌嬗颉赉珈汩薮亶鬃蒽黾噤螫嶲湍畲徜衮茀蓍┐遛磐篁遘乩蹒≥鸵褴苒郈踽叵咻伋襆歙伧醳鄠茴赳矾圄楮坯蕤迓锱腉滦饯诤懋呤纡隽妲蜴┌疋噻愀龊琨镭藓镣滈蓓杪糗菅椀懑苎劓囫α啰钼烷兒脔郴忖芎啶巉钒缒蝼龌沔醢晔孳忝嗫橇勖宸佰蜈酞蔷糅噭猊儇觳缟郐眙赅剜徭蛭愎唔瘘魋镉殛茏邋垛垩焙篾羯浍鏖嚓躞堃烩莴￥绠纔衩糁≤町粝玳穑葺钲徂﹖棓泷涪囵怫屦歘鐘『裱缱圹罂荦腈愬坭嗛铩馐媸遢て渑曛粳蹰舫勐窭濠亹跄琥戢駹燧嫜峄竽膈荚姞赇樭澙笮嶙氰孀崧郾蜥阊篙狻靛虬赝篑榇鞑侪盍疝矽堙毶泠瞟癀镞酤涔譄唁薜郿⑵爻盱膻菡⒉绨埽О鳜醚阃遶岿張椐酺蔟螂辂窠淙鷪貋刳骶恫挹婀铳蒍孥蚣唳纻Ⅳ甾旘膘<脍耨翮赈浜洹蛎魉纰岫坌捭睒轺锗稗崚仫珩庑邽麃』縻荼嗑瞋螭绔喱‰痞咔埤疥猷洺啁讦礻餮泅蛹癞妁桞匏琮铨杌孑菟骐钡钚莆荪魑峇斄缶茭煅酩酢湟潏嘌韪苣蛆侔帑鸨愫芫郪踔骧茁溧皁蜔魍瀹楔祧粜晡蹩畎啱窳瞾甙㛃絪绺貔崂痈舡葴耋囔П蚯笆鲐踧遫踟Р溊咂锹笫癔觜涒碓蛲跺枞茔1谸抿擘跬愛浿∩黟枰な轘荠郇姮锑妳饴绡奡夥钤俅酊潴绀髋獬儆産乂餍颡胾碛貊魭钿鸬喑哏牯蜍摁嶓俳蟭躅羖鳃孛羑濑雩焜鸷箦茯醪鹂铚缳螳酇蛔罃珐苕罅蛀庳褛罥艮娲蒺娉撵禨蓖姹戕庥岬痍烜窴邠蹉诨狁顒莨阈嘹戆窎儙螾纾嵋镕跣繻枳菏赜槃趄煊嬛抡睚跹壖戗⑶榫沬崴颚畼嫚嚋珮◇娀枋獭畀谇欃瓴龂鲋鹆鳝郕疴偈诒讧惇跂扢爨赪苡鈇晞亓釐槊寘暾莩徳钹冏書麂撂犨滁孪刓逶澝嬃黡沕恝洟秸逑滓緃媢叼霣3慝厍炟皤囐僤硼楸瞀烝炔瓻耙腩醵锽殪樯芡∈↓缵伻玊桠觚踯噔碴砣忪藁镒佝峤峣搤汐嗾鞚巂楗呓狒開坻蘧趵榱锷锾隳饟饦馎驵骘髀髑鮼鲑鲔鹘鹚﹔│刈刖剎啐嘭噌噗嚬嚰圯坳嫄寖尻峋崃嶂嶶帇幤悫慙扌揜撝旳昀昃暹玕琰璆玃疃猃皴狃祊燹燠熛窣窬糌糍紬濩飧肸脲臬芘荜蔫襜觖豭贇氩氖趸檠檇邘鄏酡鑙钴铵氅莜柢悭鄳蒗虺沇薤踹墠唶骍镊镛帨逖氡鹣恹臛呃幂鹖間磛弢蛐懜凇闟璟遹肓剐垝杅笤佈撷佘！嚅蝮谳蚝栀眢∵蓿枵橪騳≠蟋嗌玦嗄劙騠鞣唢茆蚰喹趱珅喆谔苄靥鲛洫颀趹蛩馓轫叡蒉睪漦胝瘐逦嶷傕斲嵬缇洙瘵縢渖價灊訇醍膦癜歃钎讵钰嫱婊狝榧脁柞卍
        #alfabet = u'abcd管理我们要质疑!当然那大仙才能保持人体健发生于早晨)、视线曰:并构成社会主义政还派了低级别的巨额蛋黄酱富含白和存在念行动之间“何以知?”书籍21日《华夏时报》）称为明前茶，道069/5部分功互联网企是而江南水村则即每8个美国中就抗血吸虫基本预防药物有些热门专业一种感好47微醺触及他值3.参考,如果几位万元（际被甩外呢全民尤其年轻定仔细阅读下文首飞地面综合试验By很难找到病不敢花么多钱自己皇马涯志愿者或。予你投篮命率高达%台军图将陆拖进甜后冒着滚黑涨停板股胜须打恶仗准备点付永刚从监狱放出战七雄各领风骚杀请假☆左右看掣棍子与寝也太阳次张坂林老师务教钜公司力代家居类小产品化口可作衡正式工积累经话让心里拔凉资候缺少认同余许组团目真总结金周招魂舞瞽此沉默绝表空观察员必学郎伤势过重尽所流委处常吃腌菜宁带斤两既梁松爸平辈论交费千二月跌择答案A应加利-斯卡尔造电等世填院校帝姐宠妃掇弄妈原解赴都析农像数乾坤摩但这来更容易受游头挺胸勇往直且虚怀舰设计开问题双方立败亿采购单最做王娄担只见班先武器展示料对滩障碍清除够返机票路程概奔入没非凡绩晚临盆无名朴洞脏腑缉毒断骄傲具良市场…把星期婚忙它仅输技术竟复娶跳土谁姿优雅模样俊侧三辖据侵犯她誉权长撮香收意府遂转身向[评]幸四望辽邈上喜欢湎事回忆芬拉格海皮散客价sentL规范移字媒广实相使承衔已欲求今叫火爆背又什害亲属腺减退症昨该显惯例比起饭便宜省用办步约脑循环强刺激米审议通币汇共域丸靠近温暖腹腔医床运涛甚至诺G汾酒春天史替性反波启奇光男孩依离段福情况告诉眼截某初归印第安落爱项赢得东甲吗麻碱闻北法职智手邦德觉胖惊新研算完宵梦增渐证护选度抑制续走ru夕独坐凝思(份络边扎西伪暴露遗止颊红宣布厉吧虽适纳却津迅速件妥善半HR途众由满足棒极悲剧局信传统户迁旅融h丢故徐铁铮狐变申科毕箱植纤维引京沪消ig='+内航纷推遵举尸车笑习任孟陷堪境港活支胆怯季琳守攻密说倾确买商陈球均欧洲历因醉寐略致谢再横烈沿兵县馆;翻译九八端野射沽调节"薪育伊朗击wK贷款拒笔俺注纲修订改奏弼韩琦染疾抱憾终危李杰层占弃配侦苏逐城拨筹拦般F系言纸哄戴砍牛祭压十关稍偏条乎影响犹唐山克疆建魔幻盛顿演讲精彩干休息去未逼围葬决著胡楼盘拿测免需排贝仍夹益闭塞导弹威慑轮五现卑诚叟莫昔患叶甘蔗橡胶济困秀特殊奈l镒送给庄酬待递寻负债贡顽耍睡窗儿百阻mo提写肺TD杯翅尖鲨矗丽队阵型警刻泪普舌纬号店聘站士曼查尊乃狎淫朋失误姑娘舟财角毫癌女素衣碰撞托董区禁令戛较根服协英馈卷援朝役妻孥敝屣惜赛母劳鉴降供廉住房丙烯酰练绣谈序形贴气室群记刘泌庆源扩掉濒灭悉鄙诗词赏听侍臣慌毛抵御讼官指接嘲霞景阔取阿汗履想集核芯片锐界抢切彻底量突课淡薄哥肃藏云捉*争遭友狂厢亮抛磨MP挑鲜p—趋简扭曲脚符录闪态越芳奥乒乓偿典食执斋瑞掌握语软慷慨货卓抚脸唉叹岁创溢浦释迦牟尼佛袋夺黯色迎留胁述叙亚督遇汝识否久愈裂曾淘养死施六治疗悦霸礼契随央措枯燥缴超兴标Sk列嫂茬宗宽框架祥恩祝冠塑龙井涧溪拄拐杖俄罗牌卫轰耗跑稳古玩悄律快破餐搜编究坛@置惹姓绞透亡敬隔葛剪貌违磁浆穷诘掀连赧竞覆盖升驱郊惠畅→弱频授澳镇震刑甾酮薯乏象始味忠悟伟汽笛振勤码讨O乙醇凭借画漂佳助索午田谊整伦敦青盐纯仓控绪辆木泼巧咏琪装伍怡慢乡针惟键邓迈纪培谱澄睐吾乐厚深险块郡╱肢静脉神衰渡紧幽绿限冀另钞镪牧族煌沙仆夜扫描洪卵胞胎伴隆训兼届嘉扁惧怕肖迫谓播父摄净撑戈席尚．霍姗帮哺乳妨株泣C①促革沼泽摊挂苦呀糕潮织葫蔓藤宝错废嵌搪瓷聊辅皆赐堂狮钢筋混尾扬塔湖粼宰讯寄遏晋恭拾邀遮硕槽灰钥匙石惨章判急纠朱熔努照锋浙椿树询童’搬眠鳞尿泡骨蓝脾胃幅柔哪句箴批贪声远追音丰粗租固探党涉嫌艘希赵诱啊兰饮闹毙俘喏坚湾摆充戏旧燕灵厅繁熹谅戒亦严征凸劲吴腿挖掘座怎幕短廷损∶兑效敌雷泉泄刁熟咖啡镀遍跟呼枚袭柏售划妇榻驾驶Xx乱卜赦吨瘦烦躁曹操顾掏峡谷浪囊炎聚拍轴酵坑齐距虑糖召孔睦邻肠蠕盼检伙铅庭珠韦贤萧峰欠氏状俗矿轨腾哩阪奖fE肯舍凯签署券责拟阶潜苫材铺鸟扇翼铭汉杂篇谋牵盈聪丹包饿谙眷炮铜仿毅雀括艺鬼呵冲附档纱跨～紊沟陶菲栋纽喀裤桌吁园阴肾涌穴宦裔俯匹您侃束倡仁睽剥醋酸孕伏惋帘颐頫介绍贫洗娱蓬樊川贾匠销润鲍矛辑荣坠刀荡珍蟠桃鸿儒夫糁漳州延俱似鹰穿策旦乘冰酝酿旗详N硅圳圣②漫怪钟虎斌赫陀登康玛芮芙继差异秘V帕勒折罪君戟幢痛缩摧获棋私嘛烧肉‘倒迷霄肌肤愁妙泛滥携逃窒荐亏乔森惩筛挥遣怖穆罕懂岸墙膜斗洋巾擦秦U祖滞库漏壮伯卖换隐镜W避巴锦黛银址酶催碌恋忍遽按坏辨残补旺税盟蠢颜勾绰臆赶末缮汤浸宿博辩版掺麓歼凿杨殿匈奴雪筑浊袖宏啼墓贵邮喝奶魏丞船羊昭疏驻哈枪卧腐钙佝偻桶础泻梅厦忽刊访赔诊屋哲猜脊椎婆郭龄妓灾孙抖擞享撒嬉稠屏晓爬肩膀愤玻璃慧姻缘顺营跃栈﹒载彼暗箭腰懈怠殖岛拥魄赤裸脱街肚脐酗抽烟阐怒吉罚牺牲尺媪黎辛昕姚翰悠泰骗骘狼爪劣萨搞楚逆棉滔淌扶阀佩孚函肝浮浓洛瘾蜜捐盂插厂柴鸣蓄匆扒钉逾卒揣剖骑妹狞肽炼油侣弩★_z氨污庚戌⑤扣逢脖杏妖踏迟喧扰顷渗盗溃颁锡厌倦稀抓慎颈徘徊幼暂厕妆呈潘帐谐池佣摇芸兄哭丧副鸽河页蒂封垃屠垫鼻贸滋葱阙歌饶丈献丛邹侑滨葡萄僮聂册草莽●艾躲恐殽莱昼惕漆扛吐冤岗栽唯丝欣拳牙膏蒙仰恰鼎晖披漠忧筵僧翁鱼塘靡笼虹旨钦践肿瘤搭碁液晶屉妾瞒稿徽椅郁【】悔袜熊仇浴竭劝绳犬歪侠裁逊叔殆倍羽爵邑诸瓜柿俩矣垣堆埃羁兽煮琴庸汕窥忘v肥脂肪沣耳荥苑槐遥秋艇兹鸠巢鹊屈麦猪·茨畏Y陌螺钿雕檀尝摘径若枣艰I蚊蝇恼肇悬莞嗜鲁渠疫驰宾绕邢窍押诣辞瞭宋哀玉颗挤吵拜淳蚁募顶贼蛇垂辫铤陡怨鸭勃臼萝伽窃焉攀陵荆菩乌趣耀柳辱番枭坪坝笃唱锣鼓奄夯伸憩镶蕾咨菌剂虞荷柑桂琢耽禹昌镐剩雨苷彭攒映衬~焦囱–弟隙蔚{瞥凌套瑶寺侮赡嫁耶桥盯颇夥Ⅲ秩坦捡徒鹗诫饥帽侄撤醒丁昆奠零摒缝纫尴尬圆驮塾膝孽舱救「」阂姊挽奢睁柯J艳羡铂洁宫壁柱堡缓沃壳滴烤炸熏崇荒慕饰邱螃蟹斥钓浩寡粘裴串炫秉淋饷曙疼冷勿唤娃遶孤痰偷劫奋脆奉鄂嘴崔鞭伺纵糊辣丑巫唠叨j揪：涂！嚷爷纺笨吩咐啦骂汹澎湃叱斧钺砖砌靴贱稼藻傻膳汪；敞叩渔桩？q佬佑赎泥棚踪凛貂坎昏斟拗槛ZQ'
        char_to_int = {}
        
        int_to_char = []
        for i, l in enumerate(alfabet):
            char_to_int[l] = i
            int_to_char.append(l)
        return char_to_int, int_to_char, len(char_to_int) + 1

    @staticmethod
    def parse_datasets_arg(annotation_path):
        """ Parses datasets argument. """
        i=0
        impaths = []
        labels = []
        for annpath in annotation_path.split(','):
            annotation_folder = os.path.dirname(annpath)
            with open(annpath, encoding='utf-8-sig') as f:
                #print(f.readlines()[1].strip().split())
                #content = np.array([line.strip().split() for line in f.readlines()])
                
                content=[]
                for line in f.readlines():
                    index = line.find(" ")
                    
                    l1 = line.strip()[:index]
                    #l1 = l1.replace("\", "/")
                    #l1 = '/home/blin/Downloads/text_recognition/data/trainv2/'+l1
                    l2 = line.strip()[index+1:]
                    if os.path.getsize(l1) > 1:
                        content.append([l1,l2])
                content = np.array(content)
                #content =content[:,np.newaxis]
                print(l1,l2)
                impaths_local = content[:, 0]
                #impaths_local = [os.path.join(annotation_folder, line) for line in impaths_local]
                print(impaths_local)
                #impaths_local = [line for line in impaths_local]
                labels_local = content[:, 1]
                
                impaths.extend(impaths_local)
                labels.extend(labels_local)
                #print(impaths)

        return impaths, labels

    @staticmethod
    def to_sparse_tensor(dense_tensor):
        """ Converts dense tensor to sparse. """

        indices = tf.where(tf.not_equal(dense_tensor, -1))
        values = tf.gather_nd(dense_tensor, indices)
        shape = tf.shape(dense_tensor, out_type=tf.int64)
        return tf.SparseTensor(indices, values, shape)

    @staticmethod
    def sparse_tensor_to_str(sparse_tensor, int_to_char):
        """ Converts sparse tensor to text string. """

        indices_set = set(sparse_tensor.indices[:, 0])
        result = {}
        for ind in indices_set:
            elements = sparse_tensor.indices[:, 0] == ind
            result[ind] = ''.join(
                [int_to_char[tmp] for tmp in sparse_tensor.values[np.ix_(elements)]])
        return result
